/* Небольшие положительные целые числа <1000 представлены тремя целочисленными полями (первая цифра, вторая цифра и третья цифра). 
Реализовать методы, переводящий число в обычное положительное целое и складывающий два таких числа.
При переполнении сложения должен получаться нуль. */

#include "pch.h"
#include <iostream>

using namespace std;

class Number {

};

int main()
{
    cout << "Hello World!\n"; 
	cout << "lalalal";
}

